---
kind: method
id: M:Autodesk.Revit.DB.FailureDefinition.Dispose
source: html/8da15e6c-ce15-c46d-8c47-1b866732ceb1.htm
---
# Autodesk.Revit.DB.FailureDefinition.Dispose Method

Releases all resources used by the FailureDefinition

## Syntax (C#)
```csharp
public void Dispose()
```